# RemoveCustomization Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemporaryViewModes..::..RemoveCustomization Method
TemporaryViewModes Class See Also
---
Removes all customized values for the TemporaryViewProperties mode.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public void RemoveCustomization()
```

Visual Basic
---
```text
Public Sub RemoveCustomization
```

Visual C++
---
```text
public:
void RemoveCustomization()
```

# See Also
TemporaryViewModes Class
Autodesk.Revit.DB Namespace